{
  "trust-is-fragile-but-necessary": {
    "file": "trust",
    "title": "Trust is fragile—but necessary",
    "subtitle": "The risks of trusting, the dangers of not, and why it’s still worth it.",
    "date": "Feb 8, 2025",
    "time": "3"
  },
  "from-invincible-to-human-the-journey-of-humility": {
    "file": "humble",
    "title": "From invincible to human: The journey of humility",
    "subtitle": "Life humbles us in ways we never expect—through the quiet erosion of time and the sharp lessons of loss. This is how they shape us, one moment at a time.",
    "date": "Feb 1, 2025",
    "time": "3"
  },
  "olympus-terraforming-repeatable-and-extensible-infrastructure-at-go-jek-42ad5b0a4f9a": {
    "file": "olympus",
    "title": "Terraforming repeatable and extensible infrastructure",
    "subtitle": "In this post, we’ll talk about our approach of assembling Infrastructure As Code that simplifies the maintenance of an increasingly complex microservices architecture for our company.",
    "date": "October 3, 2018",
    "time": "3"
  },
  "anatomy-and-mindset-of-the-data-army-at-go-jek-dd9040833356": {
    "file": "data_army",
    "title": "Anatomy and mindset of the data army at Gojek",
    "subtitle": "As data engineers, we solve problems with data to improve the product that we offer to our users. We build tools, infrastructure, frameworks, and services and on the way develop new skills, new ways of doing things, new tools, and turn our backs to traditional methods.",
    "date": "July 16, 2018",
    "time": "4"
  },
  "building-technical-documentation-as-a-product-at-scale-4c20160107a2": {
    "file": "chronicle",
    "title": "Building technical documentation as a product at scale",
    "subtitle": "In the real world, when we buy a product, it comes with a quick guide or some other form of documents which help you get going with the product. Without these documents, we’ll have to learn how to use the product leveraging solely on the ‘trial and error’ method — which is not a pleasant user experience.",
    "date": "July 4, 2018",
    "time": "5"
  },
  "asgard-a-study-to-envision-data-infrastructure-automation-at-go-jek-35dd6da2c72f": {
    "file": "asgard",
    "title": "Asgard: A case study to envision data infrastructure automation at Gojek",
    "subtitle": "Every product needs a vision. This can come from many sources; most important being solving existing pain points and fulfilling a real, deeply-felt human need. The goal is to create an experience which respects users’ time, efforts, and make product the no-brainer solution.",
    "date": "April 29, 2018",
    "time": "3"
  },
  "loki-chaos-engineering-tool-for-data-infrastructure-at-gojek-a8fdee936f17": {
    "file": "loki",
    "title": "Loki: Chaos engineering tool for data infrastructure at Gojek",
    "subtitle": "Built on the principles of Chaos Engineering, and tailored to our specific use cases, Loki is our internal disaster simulation and load testing tool. It helps ensure our data infrastructure can tolerate random instance failures.",
    "date": "April 1, 2018",
    "time": "5"
  },
  "data-infrastructure-at-go-jek-cd4dc8cbd929": {
    "file": "data_infra",
    "title": "Data infrastructure at Gojek",
    "subtitle": "Our data infrastructure lets publish and consume raw and aggregated data effortlessly and reliably. This unleashes a plethora of possibilities within Gojek. From AI-based allocations, fraud detections, recommendations, to critical real-time business reporting and monitoring.",
    "date": "March 12, 2018",
    "time": "6"
  },
  "atlas-go-jeks-real-time-geospatial-visualization-platform-1cf5e16814c5": {
    "file": "atlas",
    "title": "Atlas: Gojek’s real-time geospatial visualization platform",
    "subtitle": "At Gojek, location is built into the fabric of all our products, powering dozens of products that are used by millions of customers and drivers, daily. As a result, we have billions of GPS points flowing through our data pipelines daily in real-time. ",
    "date": "Febraury 9, 2018",
    "time": "3"
  },
  "scaling-culture-at-a-hyper-growth-organization": {
    "file": "culture",
    "title": "Scaling culture at a hyper-growth organization",
    "subtitle": "In a hyper-growth organization like Gojek, technology plays a vital role. However, as an organization matures, the hard part is not scaling the technology, but paying heed to culture.",
    "date": "December 26, 2017",
    "time": "3"
  },
  "the-art-of-being-full-stack-5b88577188fd": {
    "file": "fullstack",
    "title": "The art of being full stack",
    "subtitle": "Throughout my career, I have changed job roles more frequently than I have changed my wardrobe. So, here are a few techniques that have been instrumental in my own life in being a full-stack and kicking do-one-thing-syndrome butt.",
    "date": "September 30, 20217",
    "time": "3"
  }
}
